include("PrintStatus.js")

CurrentRateArray = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10];
CurrentTest = 1100;	// A

//-------------------------------------------------------------------------------------------------------------------------------------------
//Одиночное формирование 

function DRCU_Pulse(Current, CurrentRate)
{
	dev.w(128, Current);
	dev.w(129, CurrentRate);
	
	if(dev.r(192) == 3)
	{
		dev.c(100);
		
		while(dev.r(192) != 4)
		{
			if(dev.r(192) == 1)
			{
				PrintStatus();
				return 0;
			}
		}
		
		dev.c(101);
		sleep(50);
		
		while(dev.r(192) != 3)
		{
			if(dev.r(192) == 1)
			{
				PrintStatus();
				return 0;
			}
		}
	}
	else
		if(dev.r(192) == 1)
		{
			PrintStatus();
			return 0;
		}
	
	return 1;
}

//-------------------------------------------------------------------------------------------------------------------------------------------
//Ресурсный тест

function DRCU_Test(N)
{
	Time = [];
	Time[-1] = 0;
	for (var i = 0; i < N; i++)
	{
		for (var j = 0; j < 11; j++)
		{
			k = i*11+j;
			Time[k] = new Date();
			p("#" + (k) + " / "+ (i + 1) );
			p("№ dI/dt = " + CurrentRateArray[j]);
			p("Время паузы между импульсами, с: " + (Time[k] - Time[k-1])/1000);
			p("----------------");
			p("");
			
			if(!DRCU_Pulse(CurrentTest, CurrentRateArray[j]))
			return;
			
				
			
			if (anykey())
				return;
		}
	}
}

//-------------------------------------------------------------------------------------------------------------------------------------------
//одиночное включение-выключение формирования flyback 

function DRCU_SinglePS(delay)
{ 
dev.w(150,0);
dev.c(55);
dev.w(150,1);
 print("Включение");
 dev.c(54);
 
 sleep (delay);
dev.w(150,0);
 print("Выключение");
 dev.c(54);
 sleep (100);
}

//-------------------------------------------------------------------------------------------------------------------------------------------
//Включение разрядки БП 

function DRCU_PSDischarge() //Включение разрядки БП
{
	dev.w(150,0);
	dev.c(55);
	
while(!anykey())

	{
	dev.w(150,1);
	dev.c(55);
	sleep(100);
	}

	dev.w(150,0);
	dev.c(55);
	
}

//-------------------------------------------------------------------------------------------------------------------------------------------
//Выставление напряжения на внутреннем источнике 

function DRCU_PSSetpoint(voltage)
{
	dev.w(130,voltage*10);

	while(!anykey())
	{
		p(dev.r(201));
		sleep(2000);
	}
	dev.w(130,0);
}

//-------------------------------------------------------------------------------------------------------------------------------------------
//Импульс управления 

function DRCU_Debug(PWM, Range)
{
	dev.w(150, Range);
	dev.c(59);
	dev.w(150, PWM);
	dev.w(151, PWM);
	dev.c(60);
}

//-------------------------------------------------------------------------------------------------------------------------------------------
